alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_usart.h
/*
 * Copyright (c) 2017, NXP Semiconductors, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef _FSL_USART_H_
#define _FSL_USART_H_

#include "fsl_common.h"

/*!
 * @addtogroup usart_driver
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief USART driver version 2.0.0. */
#define FSL_USART_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*! @brief Error codes for the USART driver. */
enum _usart_status
{
    kStatus_USART_TxBusy = MAKE_STATUS(kStatusGroup_LPC_USART, 0),              /*!< Transmitter is busy. */
    kStatus_USART_RxBusy = MAKE_STATUS(kStatusGroup_LPC_USART, 1),              /*!< Receiver is busy. */
    kStatus_USART_TxIdle = MAKE_STATUS(kStatusGroup_LPC_USART, 2),              /*!< USART transmitter is idle. */
    kStatus_USART_RxIdle = MAKE_STATUS(kStatusGroup_LPC_USART, 3),              /*!< USART receiver is idle. */
    kStatus_USART_TxError = MAKE_STATUS(kStatusGroup_LPC_USART, 7),             /*!< Error happens on txFIFO. */
    kStatus_USART_RxError = MAKE_STATUS(kStatusGroup_LPC_USART, 9),             /*!< Error happens on rxFIFO. */
    kStatus_USART_RxRingBufferOverrun = MAKE_STATUS(kStatusGroup_LPC_USART, 8), /*!< Error happens on rx ring buffer */
    kStatus_USART_NoiseError = MAKE_STATUS(kStatusGroup_LPC_USART, 10),         /*!< USART noise error. */
    kStatus_USART_FramingError = MAKE_STATUS(kStatusGroup_LPC_USART, 11),       /*!< USART framing error. */
    kStatus_USART_ParityError = MAKE_STATUS(kStatusGroup_LPC_USART, 12),        /*!< USART parity error. */
    kStatus_USART_HardwareOverrun = MAKE_STATUS(kStatusGroup_LPC_USART, 13),    /*!< USART hardware over flow. */
    kStatus_USART_FifoBusError = MAKE_STATUS(kStatusGroup_LPC_USART, 14),       /*!< USART fifo bus error. */
    kStatus_USART_BaudrateNotSupport =
        MAKE_STATUS(kStatusGroup_LPC_USART, 15), /*!< Baudrate is not support in current clock source */
};

/*! @brief USART parity mode. */
typedef enum _usart_parity_mode
{
    kUSART_ParityDisabled = 0x0U, /*!< Parity disabled */
    kUSART_ParityEven = 0x2U,     /*!< Parity enabled, type even, bit setting: PE|PT = 10 */
    kUSART_ParityOdd = 0x3U,      /*!< Parity enabled, type odd,  bit setting: PE|PT = 11 */
} usart_parity_mode_t;

/*! @brief USART stop bit count. */
typedef enum _usart_stop_bit_count
{
    kUSART_OneStopBit = 0U, /*!< One stop bit */
    kUSART_TwoStopBit = 1U, /*!< Two stop bits */
} usart_stop_bit_count_t;

/*! @brief USART data size. */
typedef enum _usart_data_len
{
    kUSART_7BitsPerChar = 0U, /*!< Seven bit mode */
    kUSART_8BitsPerChar = 1U, /*!< Eight bit mode */
} usart_data_len_t;

/*! @brief USART FIFO driection. */
typedef enum _usart_fifo_direction
{
    kUSART_FifoTx = 1U, /*!< FIFO direction for transmit. */
    kUSART_FifoRx = 2U, /*!< FIFO direction for receive. */
} usart_fifo_direction_t;

/*!
 * @brief USART interrupt configuration structure, default settings all disabled.
 */
enum _usart_interrupt_enable
{
    kUSART_RxReadyInterruptEnable = (USART_INTENSET_RXRDYEN_MASK),           /*!< Receive ready interrupt. */
    kUSART_TxReadyInterruptEnable = (USART_INTENSET_TXRDYEN_MASK),           /*!< Transmit ready interrupt. */
    kUSART_TxIdleInterruptEnable = (USART_INTENSET_TXIDLEEN_MASK),           /*!< Transmit idle interrupt. */
    kUSART_DeltaCtsInterruptEnable = (USART_INTENSET_DELTACTSEN_MASK),       /*!< Cts pin change interrupt. */
    kUSART_TxDisableInterruptEnable = (USART_INTENSET_TXDISEN_MASK),         /*!< Transmit disable interrupt. */
    kUSART_HardwareOverRunInterruptEnable = (USART_INTENSET_OVERRUNEN_MASK), /*!< hardware ove run interrupt. */
    kUSART_RxBreakInterruptEnable = (USART_INTENSET_DELTARXBRKEN_MASK),      /*!< Receive break interrupt. */
    kUSART_RxStartInterruptEnable = (USART_INTENSET_STARTEN_MASK),           /*!< Receive ready interrupt. */
    kUSART_FramErrorInterruptEnable = (USART_INTENSET_FRAMERREN_MASK),       /*!< Receive start interrupt. */
    kUSART_ParityErrorInterruptEnable = (USART_INTENSET_PARITYERREN_MASK),   /*!< Receive frame error interrupt. */
    kUSART_RxNoiseInterruptEnable = (USART_INTENSET_RXNOISEEN_MASK),         /*!< Receive noise error interrupt. */
    kUSART_AutoBaudErrorInterruptEnable = (USART_INTENSET_ABERREN_MASK),     /*!< Receive auto baud error interrupt. */
    kUSART_AllInterruptEnable =
        (USART_INTENSET_RXRDYEN_MASK | USART_INTENSET_TXRDYEN_MASK | USART_INTENSET_TXIDLEEN_MASK |
         USART_INTENSET_DELTACTSEN_MASK | USART_INTENSET_TXDISEN_MASK | USART_INTENSET_OVERRUNEN_MASK |
         USART_INTENSET_DELTARXBRKEN_MASK | USART_INTENSET_STARTEN_MASK | USART_INTENSET_FRAMERREN_MASK |
         USART_INTENSET_PARITYERREN_MASK | USART_INTENSET_RXNOISEEN_MASK |
         USART_INTENSET_ABERREN_MASK), /*!< All interrupt. */
};

/*!
 * @brief System FIFO interrupt configuration structure for USART, default settings all disabled.
 */
enum _usart_fifo_interrupt_enable
{
    kUSART_RxFifoThresholdInterruptEnable =
        (VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK), /*!< Receive FIFO threshold interrupt. */
    kUSART_TxFifoThresholdInterruptEnable =
        (VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK), /*!< Transmit FIFO threshold interrupt. */
    kUSART_RxFifoTimeOutInterruptEnable =
        (VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK), /*!< Receive FIFO timeout interrupt. */
    kUSART_FifoAllinterruptEnable = (VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK | VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK |
                                     VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK), /*!< All FIFO interrupt. */
};

/*!
 * @brief USART status flags.
 *
 * This provides constants for the USART status flags for use in the USART functions.
 */
enum _usart_flags
{
    kUSART_RxReady = (USART_STAT_RXRDY_MASK),                  /*!< Receive ready flag. */
    kUSART_RxIdleFlag = (USART_STAT_RXIDLE_MASK),              /*!< Receive IDLE flag. */
    kUSART_TxReady = (USART_STAT_TXRDY_MASK),                  /*!< Transmit ready flag. */
    kUSART_TxIdleFlag = (USART_STAT_TXIDLE_MASK),              /*!< Transmit idle flag. */
    kUSART_CtsState = (USART_STAT_CTS_MASK),                   /*!< Cts pin status. */
    kUSART_DeltaCtsFlag = (USART_STAT_DELTACTS_MASK),          /*!< Cts pin change flag. */
    kUSART_TxDisableFlag = (USART_STAT_TXDISSTAT_MASK),        /*!< Transmit disable flag. */
    kUSART_HardwareOverrunFlag = (USART_STAT_OVERRUNINT_MASK), /*!< Hardware over run flag. */
    kUSART_RxBreakFlag = (USART_STAT_DELTARXBRK_MASK),         /*!< Receive break flag. */
    kUSART_RxStartFlag = (USART_STAT_START_MASK),              /*!< receive start flag. */
    kUSART_FramErrorFlag = (USART_STAT_FRAMERRINT_MASK),       /*!< Frame error flag. */
    kUSART_ParityErrorFlag = (USART_STAT_PARITYERRINT_MASK),   /*!< Parity error flag. */
    kUSART_RxNoiseFlag = (USART_STAT_RXNOISEINT_MASK),         /*!< Receive noise flag. */
    kUSART_AutoBaudErrorFlag = (USART_STAT_ABERR_MASK),        /*!< Auto baud error flag. */
};

/*!
 * @brief System FIFO status flags for USART.
 *
 * This provides constants for the USART status flags for use in the USART functions.
 */
enum _usart_fifo_flags
{
    kUSART_RxFifoThresholdFlag = (VFIFO_USART_STATUSART_RXTH_MASK),    /*!< Receive FIFO threshold reached flag. */
    kUSART_TxFifoThresholdFlag = (VFIFO_USART_STATUSART_TXTH_MASK),    /*!< Transmit FIFO threshold reached flag. */
    kUSART_RxFifoTimeOutFlag = (VFIFO_USART_STATUSART_RXTIMEOUT_MASK), /*!< Receive time out flag. */
    kUSART_FifoBusErrorFlag = (VFIFO_USART_STATUSART_BUSERR_MASK),     /*!< FIFO bus error flag. */
    kUSART_RxFifoEmptyFlag = (VFIFO_USART_STATUSART_RXEMPTY_MASK),     /*!< Receive fifo buffer empty flag. */
    kUSART_TxFifoEmptyFlag = (VFIFO_USART_STATUSART_TXEMPTY_MASK),     /*!< transmit fifo buffer empty flag. */
};

/*! @brief USART FIFO configuration structure. */
typedef struct _usart_fifo_config
{
    bool enableTxFifo;       /*!< Transmit FIFO enable  */
    bool enableRxFifo;       /*!< Receive FIFO enable  */
    uint8_t txFifoSize;      /*!< Transmit FIFO buffer size  */
    uint8_t rxFifoSize;      /*!< Receive FIFO buffer size  */
    uint8_t txFifoThreshold; /*!< txFIFO threshold */
    uint8_t rxFifoThreshold; /*!< rxFIFO threshold */
} usart_fifo_config_t;

/*! @brief USART configuration structure. */
typedef struct _usart_config
{
    uint32_t baudRate_Bps;               /*!< USART baud rate  */
    bool enableRx;                       /*!< USART receive enable.  */
    bool enableTx;                       /*!< USART transmit enable.  */
    usart_parity_mode_t parityMode;      /*!< Parity mode, disabled (default), even, odd */
    usart_stop_bit_count_t stopBitCount; /*!< Number of stop bits, 1 stop bit (default) or 2 stop bits  */
    usart_data_len_t bitCountPerChar;    /*!< Data length - 7 bit, 8 bit  */
    bool loopback;                       /*!< Enable peripheral loopback */
    usart_fifo_config_t fifoConfig;      /*!< FIFO configuration for USART. */
} usart_config_t;

/*! @brief USART transfer structure. */
typedef struct _usart_transfer
{
    uint8_t *data;   /*!< The buffer of data to be transfer.*/
    size_t dataSize; /*!< The byte count to be transfer. */
} usart_transfer_t;

